//service.c

#include "settings.h"

//--------------------------------------------------------------------------------------------------------

//************************************
// Variables
//************************************

//************************************
// Prototypes
//************************************
u8_t Get_ASCII(u8_t chr);
u8_t ASCII_To_Char(u8_t chr);
u8_t BCD_To_Char(u8_t bcd_data);
u16_t Char_To_BCD(u8_t char_data);
u32_t Int_To_BCD(u16_t int_data);
u8_t Parity(u8_t byte);
char InvertByte (char b);

int myatoi(char* s);
void uitoa(u16_t Value, u8_t* Buffer);

u16_t Rvr16(u16_t x);
u32_t Rvr32(u32_t x);
void Rvr64(u8_t *dst, u8_t *src);

//::::::::::::::::::::::::::::::::::::::::::::::::::::::
//
//::::::::::::::::::::::::::::::::::::::::::::::::::::::
u8_t Get_ASCII(u8_t chr)
{
  return((chr<10)?(chr+'0'):(chr+('A'-10)));
}

//::::::::::::::::::::::::::::::::::::::::::::::::::::::
//
//::::::::::::::::::::::::::::::::::::::::::::::::::::::
u8_t ASCII_To_Char(u8_t chr)
{
  if((chr - '0')<10) return(chr - '0');
    else
    {
      if(chr<'a') return(chr-('A'-10));
        else return(chr-('a'-10));
    }
}

//::::::::::::::::::::::::::::::::::::::::::::::::::::::
// Преобразование BCD в CHAR
//::::::::::::::::::::::::::::::::::::::::::::::::::::::
u8_t BCD_To_Char(u8_t bcd_data)
{
  u8_t result;
  result = ((bcd_data & 0xF0)>>4)*10;
  result += bcd_data & 0x0F;
  return result;
}

//::::::::::::::::::::::::::::::::::::::::::::::::::::::
// Преобразование char в BCD
//::::::::::::::::::::::::::::::::::::::::::::::::::::::
u16_t Char_To_BCD(u8_t char_data)
{
  u16_t result;
  
  *((u8_t*)&result + 1) = char_data%10;
  char_data /= 10;
  *((u8_t*)&result + 1) |= ((char_data%10)<<4);
  char_data /= 10;
  result >>=8;
  *((u8_t*)&result + 1) = char_data;
  
  return result;
}

//::::::::::::::::::::::::::::::::::::::::::::::::::::::
// Преобразование integer в BCD
//::::::::::::::::::::::::::::::::::::::::::::::::::::::
u32_t Int_To_BCD(u16_t int_data)
{
  u32_t result;
  
  *((u8_t*)&result + 3) = int_data%10;
  int_data /= 10;
  *((u8_t*)&result + 3) |= ((int_data%10)<<4);
  int_data /= 10;
  result >>=8;
  
  *((u8_t*)&result + 3) = int_data%10;
  int_data /= 10;
  *((u8_t*)&result + 3) |= ((int_data%10)<<4);
  int_data /= 10;
  result >>=8;
  
  *((u8_t*)&result + 3) = int_data;
  result >>=8;
  
  return result;
}

//::::::::::::::::::::::::::::::::::::::::::::::::::::::
// Расчеит паритета
//::::::::::::::::::::::::::::::::::::::::::::::::::::::
u8_t Parity(u8_t byte)
{
  byte ^= (byte >> 4);
  byte ^= (byte >> 2);
  byte ^= (byte >> 1);
  return (byte & 1);
}

//::::::::::::::::::::::::::::::::::::::::::::::::::::::
//
//::::::::::::::::::::::::::::::::::::::::::::::::::::::
char InvertByte (char b)
{
  char i = 8, r = 0;
  
  do
  {
    --i;
    if (b & (1 << i)) r |= (1 << (7 - i));
  }while (i);
  
  return r;
}

//::::::::::::::::::::::::::::::::::::::::::::::::::::::
//
//::::::::::::::::::::::::::::::::::::::::::::::::::::::
int myatoi(char* s)
{
  int n = 0;
  while( *s >= '0' && *s <= '9' )
  {
    n *= 10;
    n += *s++;
    n -= '0';
  }
  return n;
}

//::::::::::::::::::::::::::::::::::::::::::::::::::::::
//
//::::::::::::::::::::::::::::::::::::::::::::::::::::::
void uitoa(u16_t Value, u8_t* Buffer)
{
  u8_t i;
  u16_t Digit;
  u16_t Divisor;
  u8_t Printed = 0;

  if(Value){
    for(i = 0, Divisor = 10000; i < 5u; i++)
    {
      Digit = Value/Divisor;
      if(Digit || Printed){
        *Buffer++ = '0' + Digit;
        Value -= Digit*Divisor;
        Printed = 1;
      }
      Divisor /= 10;
    }
  }else{
    *Buffer++ = '0';
  }
  *Buffer = '\0';
}

//::::::::::::::::::::::::::::::::::::::::::::::::::::::
//
//::::::::::::::::::::::::::::::::::::::::::::::::::::::
u16_t Rvr16(u16_t x)
{
  x = ((x & 0xFFul) << 8) | ((x & 0xFF00ul) >> 8);
  return x;
}

//::::::::::::::::::::::::::::::::::::::::::::::::::::::
//
//::::::::::::::::::::::::::::::::::::::::::::::::::::::
u32_t Rvr32(u32_t x)
{
  x = ((x & 0x00FF00FFul) <<  8) | ((x & 0xFF00FF00) >>  8);
  x = ((x & 0x0000FFFFul) << 16) | ((x & 0xFFFF0000ul) >> 16);
  return x;
}

//::::::::::::::::::::::::::::::::::::::::::::::::::::::
//
//::::::::::::::::::::::::::::::::::::::::::::::::::::::
void Rvr64(u8_t *dst, u8_t *src)
{
  dst[0] = src[7];
  dst[1] = src[6];
  dst[2] = src[5];
  dst[3] = src[4];
  dst[4] = src[3];
  dst[5] = src[2];
  dst[6] = src[1];
  dst[7] = src[0];
}

//--------------------------------------------------------------------------------------------------------
